#โอเค โจทย์ให้นักเรียนตรวจสอบว่า สายอักขระที่โจทย์กำหนดให้นี้ เป็นตัวอักษรพิมพ์เล็กทั้งหมด หรือตัวอักษรพิมพ์ใหญ่
#ทั้งหมด หรือมีทั้งตัวอักษรพิมพ์ใหญ่และพิมพ์เล็กผสมกันอยู่
#1)inputเข้าก่อน2)loopเช็คคำที่ละคำ3)และเช็คว่าเป็นตัวใหญ่ ตัวเล็ก แล้วจะเก็บค่าเป็นอะไรละเพื่อบอกว่ามันมีตัวใหญ่ เป็นตัวเล็ก true false?ไม่น่า 
#4)เหมือนตัวลูปห้ามเกิน10000 5)ต้องมีตัวแปรบอกว่ามันเป็นใหญ่หมด เล็กหมด ผสม แล้วก็ปริ้นออกมาตามค่าตัวแปรที่เปลี่ยน

word=str(input())
for i in range (len(word)):
    if word.islower():
        word_is=1
    elif word.isupper():
        word_is=2
    else:
        word_is=3


if word_is==1:
    print("All Small Letter")
elif word_is==2:
    print("All Capital Letter")
elif word_is==3:
    print("Mix")